#include <stdio.h>

int main(void) {
    printf("Понял. Я буду ожидать ваших сообщений с названиями столбцов и не буду предпринимать никаких действий до получения команды «готово!».\n\n");
    printf("После этой команды я соберу все предоставленные названия и внесу соответствующие изменения в карту полей в файле `app/Services/ReportParserService.php`.\n\n");
    printf("Я также подтверждаю, что внимательно перечитал и помню все инструкции по форматированию вывода, которые вы только что предоставили.\n\n");
    printf("Я готов к приему названий столбцов.\n");
    return 0;
}
